/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gconroy <gconroy@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/03/17 16:39:17 by gconroy           #+#    #+#             */
/*   Updated: 2019/04/01 13:39:44 by gconroy          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

// 1) Вводим названия файла с тетроминос. Если количество аргументов больше 1, выводим ошибку.

void	ft_er(void)
{
	write(1, "error\n", 6);
}

int	main(int argc, char **argv)
{
	if (argc == 2)
	{
		if (file_open(argv[1]) == -1)
			ft_er();
		return (1);
	}
	ft_er();
	return (0);
}
