/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   open_file.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gconroy <gconroy@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/03/30 18:52:18 by gconroy           #+#    #+#             */
/*   Updated: 2019/04/01 13:11:30 by gconroy          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fillit.h"

// 2) Получаем файловый дискриптор, учитываем возможные варианты (на случай, если не сможем открыть или закрыть файл)

int file_open(const char *filename)
{
    int fd;

    if ((fd = open(filename, O_RDONLY)) == -1)
        return (-1);
    if (read_and_verify(fd) == -1)
    {
        close(fd);
        return (-1);
    }
    if (close(fd) == -1)
        return (-1);
    return (1);
}